In [25]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [5]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [6]:
len(df['col2'].unique())

3

In [7]:
df['col2'].nunique()

3

In [8]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [11]:
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [12]:
def times2(x):
    return x*2

In [14]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
df['col2'].apply(lambda x: x * 2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [18]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [19]:
df.drop('col1',  axis = 1, inplace = True)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [23]:
del df['col1']

In [26]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [27]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [35]:
df.sort_values(by='col2',ignore_index = True)

   col1  col2 col3
0     1   444  abc
1     4   444  xyz
2     2   555  def
3     3   666  ghi

In [36]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [37]:
data = {
    'Region': ['East', 'East', 'West', 'West', 'East', 'West'],
    'Product': ['Shoes', 'Hats', 'Shoes', 'Hats', 'Shoes', 'Hats'],
    'Sales': [200, 150, 180, 120, 90, 50]
}

df = pd.DataFrame(data)
pivot = pd.pivot_table(
    df, 
    index='Product',        # Rows
    columns='Region',       # Columns
    values='Sales',         # Values to summarize
    aggfunc='sum',          # How to summarize (sum, mean, count, etc.)
    fill_value=0            # Replace NaN with 0
)
pivot

Region   East  West
Product
Hats      150   170
Shoes     290   180

In [43]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

df.pivot_table(values='D',index=['A', 'B'],columns=['C'],fill_value= 0)

C          x    y
A   B
bar one  4.0  1.0
    two  0.0  5.0
foo one  1.0  3.0
    two  2.0  0.0